---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuilidingPadStructureIdParam
source: html/5074a55a-499f-fa34-473e-fe32d9d97f6c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuilidingPadStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId BuilidingPadStructureIdParam { get; }
```